In [1]:
%matplotlib inline
import pandas as pd

In [2]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None, encoding='UTF-8')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [5]:
len(titles)

230621

In [6]:
titles.shape

(230621, 2)

### What are the earliest two films listed in the titles dataframe?

In [13]:
c = titles
c.sort_values(by='year', ascending=False, inplace=True)
c.head(2)

                    title  year
101854  Settling of Score  2026
228030         Gods Heart  2025

### How many movies have the title "Hamlet"?

In [14]:
c = titles
c = c[c.title.str.contains('Hamlet')]
c.head()

                                title  year
62081                  Redneck Hamlet  2017
15096   Hamlet: The Fall of a Sparrow  2017
41947                     Hamlet (IV)  2016
108617                  Hamlet Frezer  2016
112318                   Hamlet (III)  2016

In [15]:
len(c)

54

### How many movies are titled "North by Northwest"?

In [19]:
c = titles
c = c[c.title == 'North by Northwest']
c.head()

                     title  year
138297  North by Northwest  1959

In [21]:
len(c)

1

### When was the first movie titled "Hamlet" made?

In [25]:
c = titles
c = c[c.title == 'Hamlet']
c = c.sort_values(by='year', ascending=True)
c.head(1)

        title  year
46365  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [26]:
c = titles
c = c[c.title == 'Treasure Island']
c = c.sort_values(by='year')
c

                  title  year
204540  Treasure Island  1918
50896   Treasure Island  1920
189691  Treasure Island  1934
96259   Treasure Island  1950
59186   Treasure Island  1972
110576  Treasure Island  1973
203909  Treasure Island  1985
178072  Treasure Island  1999

### How many movies were made in the year 1950?

In [30]:
c = titles
c = c[c.year == 1950]
c.head()

                                                    title  year
10203                     When Willie Comes Marching Home  1950
10070                                           Marmolada  1950
170346                                    Love That Brute  1950
214019                             Donde nacen los pobres  1950
166394  A Ray of Sunshine: An Irresponsible Medley of ...  1950

In [29]:
len(c)

1496

### How many movies were made in the year 1960?

In [31]:
c = titles
c = c[c.year == 1960]
c.head()

                             title  year
106492                 Sharif Daku  1960
90963          Revolver en guardia  1960
178288          The Touch of Flesh  1960
117670  Haetbit sodajineun beolpan  1960
81874   Clue of the Twisted Candle  1960

In [32]:
len(c)

1496

### How many movies were made from 1950 through 1959?

In [33]:
c = titles
c = c[(c.year >= 1950) & (c.year < 1960)]
c.head()

                                    title  year
195640                       Shi xiong di  1959
14252                La mujer y la bestia  1959
127939  Bored Hatamoto: Acrobats of Death  1959
195479                    Der Mustergatte  1959
102130                 Kang zhuang da dao  1959

In [34]:
len(c)

12656

#### Another way

In [35]:
c = titles
c = c[(c.year // 10 * 10) == 1950]
c.head()

                                    title  year
195640                       Shi xiong di  1959
14252                La mujer y la bestia  1959
127939  Bored Hatamoto: Acrobats of Death  1959
195479                    Der Mustergatte  1959
102130                 Kang zhuang da dao  1959

In [36]:
len(c)

12656

### In what years has a movie titled "Batman" been released?

In [40]:
c = titles
c = c[c.title.str.contains('Batman')]
c.head()

                                        title  year
14078                   The Lego Batman Movie  2017
86497   Batman: Return of the Caped Crusaders  2016
164316                        Batman: Anarchy  2016
168010                B@ (Batman Parody Film)  2016
33369      Batman v Superman: Dawn of Justice  2016

In [41]:
c.year

14078     2017
86497     2016
164316    2016
168010    2016
33369     2016
201222    2016
113969    2014
146801    2014
103462    2012
33571     2010
26908     2010
189111    2005
88594     1997
168842    1995
86429     1993
196175    1992
211658    1991
55577     1989
7310      1973
196103    1967
177445    1966
23950     1966
58514     1965
198320    1964
118856    1949
74047     1943
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [5]:
c = cast
c = c[c.title == 'Inception']
c.head()

,title,year,name,type,character,n
94333,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
143138,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
176819,Inception,2010,Tom Berenger,actor,Browning,8.0
190249,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
250191,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [46]:
len(c)

77

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [53]:
c = cast
c = c[c.title == 'Inception']
c[c.n.isnull()].head()

            title  year                  name   type         character   n
94333   Inception  2010  Michael (III) August  actor     LAX Passenger NaN
190249  Inception  2010              Ken Bhan  actor  Mombasan Gambler NaN
361119  Inception  2010         John Ceallach  actor     LAX Passenger NaN
659835  Inception  2010         Seve Esposito  actor   Italian Gambler NaN
666157  Inception  2010   Marcus (II) Everett  actor      Stock Broker NaN

In [52]:
len(c[c.n.isnull()])

26

### But how many roles in the movie "Inception" did receive an "n" value?

#### s.notnull()

In [65]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.notnull()]
c.head()

            title  year            name   type              character     n
143138  Inception  2010    Peter Basham  actor  Fischer's Jet Captain  44.0
176819  Inception  2010    Tom Berenger  actor               Browning   8.0
250191  Inception  2010  Virgile Bramly  actor         Bridge Sub Con  29.0
314663  Inception  2010   Michael Caine  actor                  Miles  11.0
321091  Inception  2010    Earl Cameron  actor       Elderly Bald Man  20.0

In [67]:
len(c)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

#### df.dropna()

In [107]:
c = cast
c = c[c.title == 'North by Northwest']
c = c.dropna(subset=['n'])
c.sort_values(by='n')

,title,year,name,type,character,n
840374,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3361396,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1404704,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3024085,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
343701,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2923056,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1634552,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1229083,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2357939,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1746383,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
642085,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2212083,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
447893,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1454363,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
198496,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1334726,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [108]:
c = cast
c = c[(c.title == 'Sleuth') & (c.year == 1972)]
c = c.sort_values(by='n')
c

,title,year,name,type,character,n
1644328,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
314691,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
360365,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1412647,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2619278,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1396572,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [110]:
c = cast
c = c[(c.title == 'Sleuth') & (c.year == 2007)]
c = c.sort_values(by='n')
c = c.dropna(subset=['n'])
c

          title  year           name   type    character    n
314692   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1246855  Sleuth  2007       Jude Law  actor         Milo  2.0
1741124  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet? ****

In [121]:
c = cast
c = c[(c.title.str.contains('Hamlet')) & (c.year==1921)]
c

          title  year                    name     type         character    n
7438     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
442224   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
535307   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1095274  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2106367  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2289163  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2562876  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2935728  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3209199  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [113]:
len(c)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [123]:
c = cast
c = c[(c.title == 'Hamlet') & (c.year == 1996)]
c = c[c.name.str.contains('Branagh')]
c

         title  year             name   type character    n
250281  Hamlet  1996  Kenneth Branagh  actor    Hamlet  5.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [127]:
c = cast
c = c[c.character == 'Hamlet']
c.head()

                         title  year               name   type character     n
6003                     Sugar  2008       Hamlet Abreu  actor    Hamlet  58.0
94018          Top of the Town  1937        Mischa Auer  actor    Hamlet   6.0
120093     The Sound of Spying  2014      Jonathan Ball  actor    Hamlet   NaN
154451        Suivez cet avion  1989  Fran?ois Beaulieu  actor    Hamlet  26.0
154754  Nous sommes les autres  2017       Marc Beaupr?  actor    Hamlet   NaN

In [128]:
len(c)

91

### How many people have played an "Ophelia"?

In [131]:
c = cast
c = c[c.character == 'Ophelia']
c.head()

,title,year,name,type,character,n
238855,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
395196,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
453835,Inoperable,2016,Crystal Cordero,actor,Ophelia,NaN
835461,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1315145,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN

In [132]:
len(c)

111

### How many people have played a role called "The Dude"?

In [133]:
c = cast
c = c[c.character == 'The Dude']
c.head()

                         title  year            name   type character     n
261792        The Big Lebowski  1998    Jeff Bridges  actor  The Dude   1.0
326893      Terms & Conditions  2015     Jordan Cann  actor  The Dude   9.0
480810                Stranger  2000   Scott Crowell  actor  The Dude   NaN
549887  Pizza Man vs. the Dude  2004  Chris DeMarcus  actor  The Dude   NaN
588962             Sweepstakes  1931     Mike Donlin  actor  The Dude  12.0

In [134]:
len(c)

18

### How many people have played a role called "The Stranger"?

In [135]:
c = cast
c = c[c.character == 'The Stranger']
c.head()

,title,year,name,type,character,n
24819,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,3.0
34302,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
64774,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
64777,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0
64779,Un dollaro tra i denti,1967,Tony Anthony,actor,The Stranger,1.0

In [136]:
len(c)

208

### How many roles has Sidney Poitier played throughout his career?

In [141]:
c = cast
c = c[c.name == 'Sidney Poitier']
c.head()

,title,year,name,type,character,n
1751059,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1751060,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1751061,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1751062,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1751063,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0

In [142]:
len(c)

43

### How many roles has Judi Dench played?

In [137]:
c = cast
c = c[c.name == 'Judi Dench']
c.head()

,title,year,name,type,character,n
2703455,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0
2703456,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0
2703457,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0
2703458,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0
2703459,A Study in Terror,1965,Judi Dench,actress,Sally,8.0

In [138]:
len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [145]:
c = cast
c = c[(c.name == 'Cary Grant') &
      (c.n == 2) &
      ((c.year // 10 * 10) == 1940)]
c = c.sort_values(by='year')
c.head()

                   title  year        name   type    character    n
840371  My Favorite Wife  1940  Cary Grant  actor         Nick  2.0
840381    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

In [144]:
len(c)

2

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [146]:
c = cast
c = c[(c.name == 'Cary Grant') &
      ((c.year // 10 * 10) == 1940)]
c = c.sort_values(by='year')
c.head()

,title,year,name,type,character,n
840399,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
840397,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
840353,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
840371,My Favorite Wife,1940,Cary Grant,actor,Nick,2.0
840386,Suspicion,1941,Cary Grant,actor,Johnnie,1.0

In [147]:
len(c)

23

### How many roles were available for actors in the 1950s?

In [150]:
c = cast
c = c[((c.year // 10 * 10) == 1940) &
     (c.type == 'actor')]
c.head()

,title,year,name,type,character,n
274,Kampen om tungtvannet,1948,Andreas Aabel,actor,Kasper Idland - fenrik,8.0
281,Den farlige leken,1942,Per Aabel,actor,"Fredrik Holm, doktor",NaN
282,En herre med bart,1942,Per Aabel,actor,"Ole Grong, advokat",1.0
329,Villmarkens lov,1944,Karl Aagard ?stvig,actor,Den nye oppasseren,6.0
420,Ristikon varjossa,1945,Heikki Aaltoila,actor,Musician,NaN

In [151]:
len(c)

160460

### How many roles were avilable for actresses in the 1950s?

In [152]:
c = cast
c = c[((c.year // 10 * 10) == 1940) &
     (c.type == 'actress')]
c.head()

,title,year,name,type,character,n
2440032,Around the World,1943,Lucienne & Ashour,actress,Apache Dancers,NaN
2440063,A Woman's Face,1941,Hauk (II) Aabel,actress,Nurse,NaN
2440154,Along the Navajo Trail,1945,Marlene Aames,actress,Gypsy Girl,NaN
2440155,The Best Years of Our Lives,1946,Marlene Aames,actress,Luella Parrish,17.0
2440156,The Big Clock,1948,Marlene Aames,actress,Rosa O'Flynn,NaN

In [153]:
len(c)

50911

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [155]:
c = cast
c = c[c.n==1]
c = c[c.year < 1980]
c.head()

                      title  year         name   type           character    n
277            En glad gutt  1932   Hauk Aabel  actor       Ola Nordistua  1.0
282       En herre med bart  1942    Per Aabel  actor  Ole Grong, advokat  1.0
1026  Batman Fights Dracula  1967  Jing Abalos  actor              Batman  1.0
1027  Batman Fights Dracula  1967  Jing Abalos  actor         Bruce Wayne  1.0
1031            Mighty Rock  1969  Jing Abalos  actor         Mighty Rock  1.0

In [156]:
len(c)

62781

### How many non-leading roles were available through from the beginning of film history through 1980?

In [157]:
c = cast
c = c[c.n > 1]
c = c[c.year < 1980]
c.head()

,title,year,name,type,character,n
32,Los tarantos,1963,'El Guisa',actor,Bailaor,25.0
34,Los tarantos,1963,'El Viti',actor,Cantaor,20.0
42,I Wanna Hold Your Hand,1978,Murray the 'K',actor,Himself,48.0
43,That's the Way of the World,1975,Murray the 'K',actor,Big John Little,22.0
55,In the Land of the Head Hunters,1914,Paddy 'Malid,actor,Kenada,5.0

In [158]:
len(c)

639273

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [160]:
c = cast
c = c[c.n.isnull()]
c = c[c.year == 1980]
c.head()

,title,year,name,type,character,n
472,Bob Hope's All-Star Look at TV's Prime Time Wars,1980,Willie Aames,actor,Himself,NaN
998,Afanti,1980,Abake,actor,Master Abu Laboke,NaN
1858,Faust,1980,Brian Abbott,actor,Faust,NaN
4263,Baddegama,1980,Joe Abeywickrama,actor,Silindu,NaN
4389,Usia 18,1980,Zainal Abidin,actor,Ipah's Father,NaN

In [161]:
len(c)

4227